<template>
    <section class="chart-container">
        <el-row>
            <el-col :span="24">
                <div id="chartMap" style="height:600px;"></div>
            </el-col>
        </el-row>
    </section>
</template>

<script>
    import echarts from 'echarts'
    import $ from 'jquery'

    export default {
        data() {
            return {
                chartMap: null
            }
        },

        methods: {
            drawMapChart() {
                var datax = ['上海', '丹麦', '云南', '内蒙古', '列支敦士登', '加拿大', '北京', '南斯拉夫', '吉林', '四川', '天津', '奥地利', '宁夏', '安徽', '山东', '山西', '广东', '广西', '德国', '意大利', '挪威', '新加坡', '新疆', '日本', '比利时', '江苏', '江西', '河北', '河南', '法国', '浙江', '湖北', '湖南', '澳大利亚', '瑞典', '甘肃', '福建', '美国', '英国', '荷兰', '莱索托', '贵州', '辽宁', '重庆', '陕西', '青海', '香港', '黑龙江', '俄罗斯', '利比里亚', '匈牙利', '印度尼西亚', '巴拿马', '捷克', '津巴布韦', '澳门', '菲律宾', '台湾', '海南', '瑞士', '芬兰', '西班牙', '韩国', '马来西亚', '泰国', '葡萄牙', '西藏', '保加利亚', '卢森堡', '印度', '土耳其', '墨西哥', '委内瑞拉', '巴巴多斯', '巴西', '希腊', '摩纳哥', '斯里兰卡', '新西兰', '波兰', '爱尔兰', '百慕大群岛', '秘鲁', '约旦', '英属', '古巴', '开曼群岛', '阿根廷', '乌克兰', '以色列', '厄瓜多尔', '塞内加尔', '塞浦路斯', '斯威士兰', '朝鲜', '南非', '埃及', '巴哈马群岛', '巴基斯坦', '爱沙尼亚', '瓦努阿图', '斯洛文尼亚', '智利', '维尔京群岛', '英属维尔京群岛', '荷属安的列斯', '克罗地亚', '哥伦比亚', '斯洛伐克', '格鲁吉亚', '沙特阿拉伯', '亚美尼亚', '白俄罗斯', '直布罗陀', '罗马尼亚', '马耳他', '乌兹别克斯坦', '乌拉圭', '冰岛', '圣文森特和格林纳丁斯', '圣马力诺', '摩洛哥', '科威特', '黎巴嫩', '哈萨克斯坦', '波斯尼亚和黑赛哥维那', '马尔代夫', '马达加斯加', '伊朗', '塞舌尔', '安道尔', '圣基茨和尼维斯', '大韩民国', '文莱达鲁萨兰国', '萨摩亚', '伯利兹', '库克群岛', '毛里求斯', '阿鲁巴岛', '吉尔吉斯斯坦', '阿联酋', '乌干达', '喀麦隆', '多米尼加共和国', '孟加拉', '安提瓜和巴布达', '尼日利亚', '拉托维亚', '立陶宛', '纳米比亚', '越南', '阿曼', '安圭拉岛', '斐济', '海地', '科特迪瓦', '突尼斯', '阿塞拜疆', '伊拉克', '危地马拉', '巴拉圭', '布隆迪', '特立尼达和多巴哥', '玻利维亚', '蒙古', '中国', '也门', '加纳', '叙利亚', '摩尔多瓦', '柬埔寨', '洪都拉斯', '萨尔瓦多', '贝宁', '阿富汗', '阿尔及利亚', '马里', '塞尔维亚', '巴哈马', '拉脱维亚', '泽西岛', '肯尼亚', '乍得', '尼泊尔', '根西岛', '牙买加', '马恩岛', '卡塔尔', '哥斯达黎加', '特克斯和凯科斯群岛', '马其顿', '坦桑尼亚', '埃塞俄比亚', '安哥拉', '几内亚', '缅甸', '刚果共和国'];
                var datay = [627574, 10080, 78354, 40147, 1562, 13131, 769172, 26, 84527, 438319, 264344, 7911, 15910, 437929, 813037, 87530, 1659275, 126979, 150083, 21921, 3049, 5968, 48543, 526609, 7459, 2068335, 106744, 188433, 296716, 55419, 1501964, 281585, 247407, 10534, 24399, 48987, 309264, 380026, 29540, 42855, 1, 78765, 295745, 230899, 225702, 8287, 32298, 174361, 2034, 1, 647, 75, 236, 1046, 5, 715, 108, 262373, 14717, 41495, 14532, 5394, 128532, 1335, 505, 289, 1830, 89, 1999, 2623, 1001, 600, 44, 1072, 1680, 262, 130, 19, 1614, 587, 2025, 1035, 13, 32, 1781, 142, 4809, 127, 137, 6351, 17, 2, 288, 1, 115, 1185, 52, 116, 23, 63, 9, 281, 174, 2126, 138, 308, 105, 75, 104, 7, 857, 8, 38, 21, 39, 155, 5, 14, 193, 12, 15, 52, 14, 23, 33, 2, 4, 1, 31, 165, 12, 5, 75, 89, 230, 69, 19, 129, 2, 6, 239, 2, 1, 5, 12, 7, 12, 2, 25, 2, 57, 3, 7, 7, 8, 1, 16, 6, 9, 6, 2, 1, 2, 1, 54, 29284, 4, 14, 5, 5, 76, 1, 2, 4, 10, 6, 159, 11, 84, 34, 12, 6, 1, 3, 4, 5, 7, 14, 4, 1, 2, 2, 2, 1, 2, 4, 13];
                var data = [];
                for(var i = 0; i < datax.length; i++){
                    data.push({
                        name: datax[i],
                        value:datay[i]
                    });
                }

                var myChart = this.chartMap;
                myChart = echarts.init(document.getElementById('chartMap'));
                $.get('../../static/china.json',function(geoJson){
                    echarts.registerMap('china',geoJson);
                    myChart.setOption({
                        tooltip: {
                            trigger: 'item',
                            formatter: '{b}<br/>{c} '
                        },
                        toolbox: {
                            show: true,
                            orient: 'vertical',
                            left: 'right',
                            top: 'center',
                            feature: {
                                dataView: {readOnly: false},
                                restore: {},
                                saveAsImage: {}
                            }
                        },
                        visualMap: {
                            min: 100000,
                            max: 2000000,
                            text:['High','Low'],
                            realtime: false,
                            calculable: true,
                        },
                        series: [
                            {
                                type: 'map',
                                map: 'china',
                                geoIndex: 0,
                                aspectScale: 0.75, //长宽比
                                showLegendSymbol: false, // 存在legend时显示
                                label: {
                                    normal: {
                                        show: true
                                    },
                                    emphasis: {
                                        show: false,
                                        textStyle: {
                                            color: '#fff'
                                        }
                                    }
                                },
                                roam: true,
                                itemStyle: {
                                    normal: {
                                        areaColor: '#c9cec7',
                                        borderColor: '#000000',
                                    },
                                    emphasis: {
                                        areaColor: '#eed815'
                                    }
                                },
                                animation: false,
                                data: data
                            }
                        ]
                    });
                });

            },
            drawCharts() {
                this.drawMapChart()
            },
        },
        mounted: function () {
            this.drawCharts()
        },
        updated: function () {
            this.drawCharts()
        }
    }
</script>

<style scoped>
    .chart-container {
        width: 100%;
        float: left;
    }
    /*.chart div {
        height: 400px;
        float: left;
    }*/

    .el-col {
        padding: 30px 20px;
    }
</style>
